Tekla Open API Reference for Tekla Structures 2025
Distance Properties
The Distance type exposes the following members.
Properties
Name | Description
CurrentUnitType
 Gets or sets the current unit type.
Millimeters
 Gets or sets the distance in millimeters.
UseFractionalFormat
 Gets or sets a boolean value indicating whether to use the fractional format for US imperial units.
UseUnitsInDecimalString
 Gets or sets a boolean value indicating whether to use units in the decimal string representation.
Value
 Gets or sets the distance value in current units.
Top
See Also
Reference
Distance Structure
Tekla.Structures.Datatype Namespace